функция 10_процентов_на_весь_детский_ассортимент_771(пКодарт)
{
пСтрокаМаг=";UP;UK;BD;PY;OD;PB;SB;PZ;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";61505;61507;61508;78442;78532;78535;78538;78539;80225;99962;99963;99964;99965;100703;110941;110942;120760;120761;120762;121773;121774;121775;139649;139650;139651;139652;139653;139655;139693;148740;148741;151527;151528;151529;181854;"
пСтрока.2=";197210;197213;197215;197219;206367;206368;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
