функция 20_процентов_на_белый_и_красный_цвет_522(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;RS;SD;AT;UP;;BL;KM;TP;GB;SF;CV;UK;LT;JM;US;PY;RB;OO;OB;OD;UM;PM;PB;SB;GM;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";181650;181653;211093;211095;211260;212478;212479;212491;213377;213382;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
