Функция _Акция2джемп()
{
#Акция с 24.11 по 05.12 при покупке второго джемпера скидака на самый дешевый из них 30 %

пСтрока.1=";134410;134628;134895;139323;138768;132835;128143;128746;132193;134076;119592;119593;120839;122588;120279;122969;121367;122249;133257;134409;142438;96673;98083;132005;131199;133254;112197;110928;112607;116313;120512;120292;119594;";
пСтрока.2=";132211;119471;93139;116365;126585;124577;124576;120840;134077;132847;135663;134033;134411;134630;134627;136323;137550;136264;136138;139706;137703;136263;127382;99345;105076;103517;106790;107833;107706;112739;125676;124301;124302;";
пСтрока.3=";137889;137551;142437;103863;99401;100664;100459;102518;103481;100457;108597;139701;106236;103722;124579;123423;143928;99128;99118;139705;139324;132156;132155;132152;132157;132158;132159;134676;141453;143927;124864;122968;125080;125094;";
пСтрока.4=";127723;122967;125081;127415;111692;114578;114876;114877;126204;115232;111791;124865;131908;118636;114878;123847;126127;101740;98765;104275;107708;132846;141303;128356;131063;133036;128634;131202;122779;122342;122596;123431;119604;";
пСтрока.5=";113621;116118;132188;132187;132189;132190;132191;134087;134412;93140;95315;93137;96274;122595;126219;121354;113807;126594;123870;123871;131151;127678;127239;130931;127383;127384;119386;116975;118837;118753;118401;119427;118651;118752;";
пСтрока.6=";117167;89386;96715;99132;105734;103479;102593;102914;104495;104433;106210;124304;107321;139702;141273;141310;141311;142673;141673;141718;141315;141719;141720;107838;108749;108938;131979;131985;109180;118066;118639;124575;141312;141313;";
пСтрока.7=";106230;129428;132153;139344;141316;139729;139734;132184;132185;142271;132186;142271;132186;141720;126104;126296;127403;127803;126436;133044;"
пСтрока.8=";88404;79594;79502;87496;80793;88763;89338;89028;88623;123740;123647;124305;123725;143970;142831;134907;135082;134909;137672;138027;138124;138123;134491;134814;134283;137726;135096;137884;138122;134773;137945;134908;138972;137973;";
пСтрока.9=";138175;138087;138164;137976;139197;138971;141903;135965;109279;99588;100909;98963;99770;99211;99431;99210;99433;99205;99212;106197;111323;110900;110616;119877;124335;127510;127695;98666;135888;135090;99206;";
#оставим пустую строку, мало ли надо будет добавить что-нить в акцию

пКолСтрокАкции=10;#количество строк длиной меньше 255 символов
пКолАкции=0;
пСтрокаАкции="";
пСтрокаАкции2="";
пСуммаДжемп=10000;
пСуммаДжемп2=10000;
пКодАрт2=0;
#Объект пМасТов;
#Объект оМасТов;
#Очистить(оМасТов);
ДляВСех(Наименований())
{
пСч=1;
пКодАрт=";"+'Наим.Иерархия.НомНомер'+";";
пКатегория=";"+'Наим.ИЕРАРХИЯ.Иерархия.НомНомер'+";";
Если(Наим.СуммаЦен>0 и Наим.Цена2==0)
   {
    Пока(пСч<пКолСтрокАкции)
         {
            Если(Найти(пСтрока[пСч],пКодАрт)!=0)
               {#если нашли в списке товаров из акции наш товар,то выходим из цикла поиска
               пСч=1000;#типа выход из цикла               
               пКолАкции+=Наим.Кол_во;
               #оМасТов[Наим.Цена3]+=";"+Наим.НомНомер;
               #находим самую дешевую вещь и запоминаем ее код, второй джемпер тоже запоминаем, т.к. на него не распространяется скидка по дисконту
               если(пСуммаДжемп>Наим.Цена3) 
               {
                  если(пСуммаДжемп2==10000 и Наим.Кол_во==1)
                  {
                     пСуммаДжемп2=Наим.Цена3;
                     пСтрокаАкции2='Наим.НомНомер';
                  }
                  пСуммаДжемп=Наим.Цена3;
                  пСтрокаАкции='Наим.НомНомер';
               }
               иначе
               {
                  пСуммаДжемп2=Наим.Цена3;
                  пСтрокаАкции2='Наим.НомНомер';               
               }
               }
            пСч++;
         }
         
   }
}
если(пКолАкции>=2)
{
ДляВСех(Наименований())
{
   Если(Найти(пСтрокаАкции,'Наим.НомНомер')!=0)
   {                      
      Наим.СуммаЦен=Окр((пСуммаДжемп*Наим.Кол_во-пСуммаДжемп*0.5),1);
      если(пКолАкции>1)
      {
         '.Примечание'="Акция 2джемпера=-50%";
      }
      Сохранить(Наим);
   }
   Если(Найти(пСтрокаАкции2,'Наим.НомНомер')!=0)
   {
      Наим.СуммаЦен=Окр((пСуммаДжемп2*Наим.Кол_во),1);
      Сохранить(Наим);
   }

}
}

}