Функция _АкцияНоскиМуж796959Атлант_280()
{
#акция по носкам муж_79_69_59
пКолАкции=0;   
пКодАрт="";
   ДляВсех(Наименований()) 
   {
      пКодАрт=";"+'НАИМ.Иерархия.НомНомер'+";";
      Если(носки_муж796959атлант_280(пКодарт)==1) пКолАкции+=Наим.Кол_во;
   }
   ДляВсех(Наименований()) 
   {
      пКодАрт=";"+'НАИМ.Иерархия.НомНомер'+";";
      Если(носки_муж796959атлант_280(пКодарт)==1)
      {
      Если(пКолАкции==2) 
         {
            'Наим.СуммаЦен'=69*Наим.Кол_во;
            'Наим.Комментарий'="280";
Сохранить(Наим)
            '.Примечание'+="280;";
         }
      Если(пКолАкции>=3) 
         {
            'Наим.СуммаЦен'=59*Наим.Кол_во;
            'Наим.Комментарий'="280";
Сохранить(Наим)
            '.Примечание'+="280;";
         }
      }
   }

}