Функция _Акция_985()
{
#акция по детскому 2 вещи минус 20, три вещи минус 30
пКолАкции=0;   
пКодАрт="";
   ДляВсех(Наименований()) 
   {
      пВкл=0
      пКодАрт=";"+'НАИМ.Иерархия.НомНомер'+";";
      пЦена2=ЦенаНаДату('Дата',"Цена2")
      пВкл=_ТКК_985(НАИМ.Иерархия.НомНомер)
      Если(пВкл==0) пВкл=минус_20_и_30_детское_985(пКодарт)
      Если(пВкл==0) пВкл=минус_20_и_30_детское2_990(пКодарт)
      
      Если(пВкл==1
      и Наим.СуммаЦен>0
      и пЦена2==0) пКолАкции+=Наим.Кол_во;
   }
Если(пКолАкции>=2)
   ДляВсех(Наименований()) 
   {
      пВкл=0
      пКодАрт=";"+'НАИМ.Иерархия.НомНомер'+";";
      пЦена2=ЦенаНаДату('Дата',"Цена2")
      пВкл=_ТКК_985(НАИМ.Иерархия.НомНомер)
      Если(пВкл==0) пВкл=минус_20_и_30_детское_985(пКодарт)
      Если(пВкл==0) пВкл=минус_20_и_30_детское2_990(пКодарт)
      Если(пВкл==1
      и Наим.СуммаЦен>0
      и пЦена2==0)
      {
      пЦена3=ЦенаНаДату('Дата',"Цена3")
      Если(пКолАкции==2) 'Наим.СуммаЦен'=Окр(Наим.Кол_во*0.8*пЦена3,1);
      Если(пКолАкции>=3) 'Наим.СуммаЦен'=Окр(Наим.Кол_во*0.7*пЦена3,1);
      'Наим.Комментарий'="985";
      Сохранить(Наим);
      '.Примечание'+="985;";
      }
   }
}

#1	32	321
#1	33	349
#1	32	336
#1	32	326
#1	33	354
#1	33	364
#1	32	340
#2	34	369
#1	33	346
#1	32	318
#1	32	343
#13	43	494
#13	43	505
#13	44	532
#13	44	522
#1	3	194
#1	32	331
#1	32	323
#1	33	347
#1	32	322
#1	3	202
#1	33	344
#13	43	501
#13	44	529
#1	32	315
#1	32	316
#1	32	319
#1	32	320
#1	32	324
#1	32	325
#1	32	328
#1	32	342
#1	33	345
#1	33	350
#1	33	352
#1	33	353
#1	33	356
#13	43	509
#13	43	512
Функция _ТКК_985(пКодарт)
{
#детское
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;BL;KM;TP;GB;;BK;CV;;UK;LT;JM;BD;US;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;CB;CD;NP;BB;;BP;GB;PZ;PT;PC;PZ;PY;PM;JM;UK;GB;UZ;UM;DM;BD;EU;CB;BK;OO;OD;KM;RS;RB;UP;NP;TP;ES;SD;OK;PR;PB;SL;SB;MD;GL;GD;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пВкл=0;
пСтрока1_3=";194;202;";
пСтрока1_32=";315;316;318;319;320;321;322;323;324;325;326;328;331;336;340;342;343;";
пСтрока1_33=";344;345;346;347;349;350;352;353;354;356;364;";
пСтрока2_34=";364;";
пСтрока13_43=";494;501;505;509;512;";
пСтрока13_44=";522;529;532;"

ДляВсех(Товаров(1,пКодарт))
   {
      Если('ТОВАР.Класс'=="1" 
      и 'ТОВАР.Группа'=="3"
      и Найти(пСтрока1_3,'ТОВАР.Категория')!=0
      и пВкл==0) пВкл=1;

      Если('ТОВАР.Класс'=="1" 
      и 'ТОВАР.Группа'=="32"
      и Найти(пСтрока1_32,'ТОВАР.Категория')!=0
      и пВкл==0) пВкл=1;

      Если('ТОВАР.Класс'=="1" 
      и 'ТОВАР.Группа'=="33"
      и Найти(пСтрока1_33,'ТОВАР.Категория')!=0
      и пВкл==0) пВкл=1;

      Если('ТОВАР.Класс'=="2" 
      и 'ТОВАР.Группа'=="34"
      и Найти(пСтрока2_34,'ТОВАР.Категория')!=0
      и пВкл==0) пВкл=1;

      Если('ТОВАР.Класс'=="13" 
      и 'ТОВАР.Группа'=="43"
      и Найти(пСтрока13_43,'ТОВАР.Категория')!=0
      и пВкл==0) пВкл=1;

      Если('ТОВАР.Класс'=="13" 
      и 'ТОВАР.Группа'=="44"
      и Найти(пСтрока13_44,'ТОВАР.Категория')!=0
      и пВкл==0) пВкл=1;
   }
Если(пВкл==1) Вернуть(1)
Иначе Вернуть(0)
}