Функция _АкцияСланцы()
{
пКолАкции=0;   
пКодАртикул="";
   ДляВсех(Наименований()) 
   {
      пКодАртикул=";"+'НАИМ.Иерархия.НомНомер'+";";
      Если (
         Найти(Вверх('Наим.Наименование'),"СЛАНЦЫ")!=0 и (пКодАртикул!=";198089;"  и пКодАртикул!=";196859;" и пКодАртикул!=";196861;"   и пКодАртикул!=";196343;"  и пКодАртикул!=";198345;" 
   и пКодАртикул!=";1963408;"   и пКодАртикул!=";196341;"   и пКодАртикул!=";196344;"   и пКодАртикул!=";196340;"   и пКодАртикул!=";196342;"   и пКодАртикул!=";196345;")
      ) 
      {
      пКолАкции+=Наим.Кол_во;
      }
      
   }
   
   ДляВсех(Наименований()) 
   {
      пКодАртикул=";"+'НАИМ.Иерархия.НомНомер'+";";
      Если (
         Найти(Вверх('Наим.Наименование'),"СЛАНЦЫ")!=0 и (пКодАртикул!=";198089;"  и пКодАртикул!=";196859;" и пКодАртикул!=";196861;"   и пКодАртикул!=";196343;"  и пКодАртикул!=";198345;" 
   и пКодАртикул!=";1963408;"   и пКодАртикул!=";196341;"   и пКодАртикул!=";196344;"   и пКодАртикул!=";196340;"   и пКодАртикул!=";196342;"   и пКодАртикул!=";196345;")
  ) 
      Если(пКолАкции>=2) 
         {
            'Наим.СуммаЦен'=Окр(297*Наим.Кол_во,1);
            '.Примечание'="Акция-сланцы";
         }
     
   }
}