Функция _АкцияДжинсыФутболка()
{
#Акция с 06.05 по 09.05 при покупке джинсов, скидка на футболку 20%
#массив то что нужно включить в акцию(эти товары исключаются словами и категориями, а по этому массиву строго определяется, что этот товар участвует в акции)
пСтрока.1=";23176;23387;28691;29814;30575;31208;31590;32006;35151;35403;35410;35413;35865;39835;42395;44667;44770;65951;65973;65974;82204;84861;87623;111589;111590;111592;121064;121065;121066;121068;121071;121125;"
пСтрока.2=";121126;122284;122285;122289;122290;122292;122293;122294;122296;122298;122299;122722;122724;122729;123425;123426;123427;123429;125006;125007;125008;125009;139326;139333;139334;139335;139336;139339;139341;"
пСтрока.3=";2002;139342;139345;139349;139379;139386;139391;140375;140378;143105;143106;143109;143110;143113;143115;143116;143117;143118;143119;143120;143122;195973;192855;"
пСтрока.4=""
пСтрока.5=""
пСтрока.6=""
пСтрока.7=""
пСтрока.8=""
пСтрока.9=""
пСтрока.10=""
пСтрока.11=""
пСтрока.12=""
пСтрока.13=""
пСтрока.14=""
пСтрока.15=""
пСтрока.16=""
пСтрока.17=""
пСтрока.18=""
пСтрока.19=""
пСтрока.20=""
пСтрока.21=""
пСтрока.22=""
пСтрока.23=""
пСтрока.24=""
пСтрока.25=""
пСтрока.26=""
#
пКолСтрокАкции=27

#масиив, который нужно исключить из акции
пСтрокаИскл.1=";2038;2384;4289;4290;4293;4294;4295;4296;4297;4298;4300;4301;4302;4303;4304;5294;5420;5421;5424;5425;5426;5427;5682;5795;5833;6463;6646;7226;9274;9371;9467;10055;10056;10060;10674;12264;12274;12275;12276;"
пСтрокаИскл.2=";12277;12278;12502;13411;13412;13414;13416;13435;13793;14872;15264;17668;17669;17929;18006;18097;18593;18595;18596;18597;18601;18618;18619;18620;18621;18623;18635;18660;18662;18663;18938;19607;19608;19696;"
пСтрокаИскл.3=";20163;20239;20641;20644;20646;20648;21209;21432;21617;21705;21802;21803;21805;21890;22049;22050;22290;22357;22358;22373;22587;22773;22779;23436;23439;23440;23442;23444;23724;23970;24320;24503;25169;25532;"
пСтрокаИскл.4=";25873;26006;26387;26446;26795;26798;27058;27069;27070;27075;27353;27355;27595;27939;28031;28302;28495;28852;28886;28887;28890;29205;30495;31424;31425;32447;32957;32959;32962;32966;33027;33031;33033;33035;"
пСтрокаИскл.5=";33037;33039;33041;33043;33045;33047;33583;33584;33585;34418;34419;34421;34741;35462;35637;35662;36101;36128;36129;36130;36151;36152;36734;36736;36913;36916;36918;36919;36923;36925;36927;36928;36930;36932;"
пСтрокаИскл.6=";36976;36984;36986;36988;37008;37010;37012;37814;37815;37816;38292;38329;38956;38998;38999;39675;40655;40956;41346;41386;41421;41904;42528;42652;42658;42663;43065;43635;43637;43639;43646;43648;43650;43760;"
пСтрокаИскл.7=";43784;44270;44275;44278;44282;44283;44284;44301;44302;44308;44310;44516;45472;46349;47097;47099;47121;47123;48303;48429;48431;48459;48851;48891;48896;49929;50167;50169;50171;50175;50177;50906;50908;51003;"
пСтрокаИскл.8=";51004;51095;52868;53592;53594;54430;54431;54432;54433;54434;54435;54436;54437;54438;54439;54440;54441;55197;55703;55707;55755;55758;55759;55760;55761;55765;55766;55778;55785;55953;55959;55963;56536;56538;"
пСтрокаИскл.9=";56542;56660;57048;57050;57216;57218;57220;57222;57224;57225;57227;57229;57231;57233;57237;57239;57244;57245;57248;57255;57437;57446;57455;57458;57466;57467;57470;57489;58065;58072;58083;58090;58144;59002;"
пСтрокаИскл.10=";59114;59328;59589;59811;60273;60395;60397;60406;60534;61290;61605;61791;61794;61825;63223;63232;63493;63897;64867;65220;65788;66272;66292;66320;66626;66919;67054;67058;67176;67738;69738;69741;69744;69748;"
пСтрокаИскл.11=";69751;70060;71282;71597;71600;71946;71947;71966;71967;72851;72995;73223;73226;74032;74729;74741;75134;75403;75696;75993;75999;76000;76003;76006;76016;76019;76022;76029;76032;76041;76044;76378;76381;76931;"
пСтрокаИскл.12=";77409;77819;77822;77884;77906;77907;78093;78510;78513;78824;79405;79615;79655;80061;80064;80067;80073;80076;80626;80635;80767;80854;80855;81133;81153;81154;81870;81876;81877;81880;81881;81993;84883;85398;"
пСтрокаИскл.13=";86701;86702;86703;86704;86706;86707;86788;86796;86802;87702;87821;87876;87886;87949;88203;88471;88500;88557;88569;88593;88596;88621;88649;88758;89032;89400;89439;90006;90077;90184;90803;90804;90868;91643;"
пСтрокаИскл.14=";91647;91652;91830;91832;91835;91850;92170;92334;92335;92336;92718;93197;93255;93622;93804;94158;94487;94638;94639;94640;94641;94642;94643;94644;94645;94646;94647;94648;94649;94650;94651;94652;94653;94654;"
пСтрокаИскл.15=";94655;94656;95100;95671;95965;96193;96259;96672;97116;97984;98084;98085;98121;98145;98153;98155;98157;98163;98168;98170;98184;98248;99016;99017;99018;99019;99571;99581;99924;99930;99966;99967;99968;99969;"
пСтрокаИскл.16=";99983;100041;100288;100452;100539;100540;100541;100542;100569;100570;100571;100572;100579;100580;100581;100582;101665;101669;101742;102563;102566;102569;102572;102624;103440;104375;105691;105762;105930;"
пСтрокаИскл.17=";106459;106461;106619;106702;107249;107250;107587;107659;107873;108114;108115;108150;108152;108911;108939;109087;109181;109775;110822;110825;111063;111851;112323;112358;112881;112887;112890;112988;112989;"
пСтрокаИскл.18=";112990;113097;113422;114241;114244;115832;115833;115834;115835;115836;115837;115838;115839;115841;115842;115844;115846;115847;115849;115850;115851;115852;115853;115854;115855;115874;115875;115876;115877;"
пСтрокаИскл.19=";115878;117217;117473;117475;117476;117477;117478;117600;117601;117602;117603;117604;117605;117606;117607;117608;117609;117883;117885;117892;117893;118142;118203;118297;118885;119688;120092;120757;121362;"
пСтрокаИскл.20=";121781;121782;121816;121817;121818;121819;122211;122670;122679;123657;123888;123890;124105;124367;124553;124846;125922;125923;125924;125925;125926;125927;125928;125929;125930;125931;127009;127264;127275;"
пСтрокаИскл.21=";128609;129541;129892;129895;132265;132266;132650;132854;133056;133324;133326;133330;133831;133832;133833;133965;134196;134477;134486;134574;134955;134990;134991;134992;134993;134994;134995;134996;134997;"
пСтрокаИскл.22=";134998;134999;135163;135285;135286;135287;135288;135298;135299;136150;136204;136205;139487;139527;139529;139530;139531;139532;139533;140744;140773;140779;140780;140797;140798;140799;140800;140804;140805;"
пСтрокаИскл.23=";140806;140807;140826;140827;140828;140839;140841;140842;140897;140899;140901;140902;140904;140905;140932;140933;143816;143821;191132;191133;191236;191258;191261;191262;191263;192889;193023;193130;193136;"
пСтрокаИскл.24=";193624;194373;194516;194526;194593;195611;196923;196924;96073;95687;95965;95971;96084;91774;110091;110097;190742;119616;195456;131679;135119;"

#оставим пустую строку, мало ли надо будет добавить что-нить в акцию
пКолСтрокАкцииИскл=25;#количество строк длиной меньше 255 символов
#строка категорий которые участвуют в акции
пСтрокаКат=";65;61;62;63;116;";
#строка категорий с джинсами
пСтрокаКатДжинсы=";106;107;115;118;";
#набор слов по которым будем исключать неугодные нам товары
пСтрокаИсключений="сороч;комп;купал;брюк;плат;халат;юбка;сарафан;лосины;капри;комб;пальто;набор;пояс;пиж;бридж;боди;панталон;костюм;бюст;леггинс;легинс;кимон;комби;кальс;бермуд;кофт;пинетки;тр;стринг;бикини;шорты;танг;плавки;боксер;галст;ползун;"
Объект оМасИсключенийСлова;
пСтрокаФутбЦена3=10000;
#пихаем эти слова в массив
Разбить(пСтрокаИсключений,";",оМасИсключенийСлова);
#массив слов по которым будем исключать неугодные нам товары

пКолАкции=0;
############# блок поиска и сохранения джинс в чеке
фДжинсы=0;#это чтобы иключить джинсы, чтобы на них скидка не пробивалась
фДжинсыГлоб=0; #флаг нахождения джинс в чеке
пСтрокаДжинсНомер="";
пСтрокаДжинсЦена3="";

пСтрокаФутбНомер="";
пСтрокаФутбЦена3="";
пСлово=0;
пСчет=1;
ДляВСех(Наименований())
{
фДжинсы=0;
######джинсы ищем
пСчет=1;#счетчик элементов массива со словами-исключениями
пКатегория=";"+'НАИМ.Иерархия>Иерархия.НомНомер'+";"; 
Если(Найти(пСтрокаКатДжинсы,пКатегория)!=0) 
{#если товар из категории джинсы и если не содержит слов-исключений
Пока(пСчет<Размер(оМасИсключенийСлова))
   {
   пИскл=Вверх(оМасИсключенийСлова[пСчет])
   Если(Найти(Вверх('НАИМ.Наименование'),пИскл)!=0)
      {
      пСчет=1000;#выход из цикла если нашли слово-исключение
      }
   пСчет++;
   }
#проверка по какому условию вышли из цикла если просто перебрали все слова-исключения
#то записываем номер и цену товара
Если(пСчет<900)
   {
      пСтрокаДжинсНомер+='Наим.НомНомер'+";";
      пСтрокаДжинсЦена3+='Наим.Цена3'+";";
      фДжинсы=1;
      фДжинсыГлоб=1;
   }
}
Иначе
{
Если(Найти(Вверх('НАИМ.Наименование'),"ДЖИНСЫ")!=0)
   {
      пСтрокаДжинсНомер+='Наим.НомНомер'+";";
      пСтрокаДжинсЦена3+='Наим.Цена3'+";";
      фДжинсы=1;
      фДжинсыГлоб=1;
   }
}
######джинсы ищем
#######футболки ищем##########################################################################################
пСчет=1;#счетчик элементов массива со словами-исключениями
пСч2=1;#счетчик элементов массива с товарами которые входят в акцию несмотря ни на что
пКодАрт=";"+'Наим.Иерархия.НомНомер'+";";#товар который входит в акция несмотря ни на что
пКатегория=";"+'НАИМ.Иерархия>Иерархия.НомНомер'+";";  
пСлово=0;#флаг участия товара в акции

Если(Найти(пСтрокаКат,пКатегория)!=0)
{
пСлово=1;
#если товар из категории БМ,БЖ и ВО_Дж и если не содержит слов-исключений
#цикл поиска товаров которые входят в акцию несмотря на слова-исключения
пСчет2=1;
пИскл2="";
Пока(пСчет2<Размер(оМасИсключенийСлова))
   {
   пИскл2=Вверх(оМасИсключенийСлова[пСчет2])
   Если(Найти(Вверх('НАИМ.Наименование'),пИскл2)!=0)
      {
      пСчет2=1000;#выход из цикла если нашли слово-исключение
      #отладить();
      }
   пСчет2++;
   }
Если(пСчет2>900)
   {
   пСлово=0;
   #отладить();
   }
}
пСч=1;
пСч2=1;
Если(пСлово!=0)
{ 
Пока(пСч<пКолСтрокАкцииИскл)
   {
            Если(Найти(пСтрокаИскл[пСч], пКодАрт)!=0)
              {#товар, который не участвует в акции
               пСч=1000;#типа выход из цикла               
               пСлово=0;
               }
            пСч++;
    }
}

Если(пСлово==0)
{
   Пока(пСч2<пКолСтрокАкции)
   {
            Если(Найти(пСтрока[пСч2], пКодАрт)!=0)
                  {#товар который должен участвовать в акции
                     пСч2=1000;#типа выход из цикла               
                     пСлово=1;
                  }
            пСч2++;
   }
}  
#отладить();
   Если(Наим.СуммаЦен>0 и Наим.Цена2==0 и пСлово==1 и фДжинсы==0)
   {
      Если(пСтрокаФутбЦена3==0) пСтрокаФутбЦена3=10000
               если(пСтрокаФутбЦена3>Наим.Цена3)
               {
                  пСтрокаФутбЦена3=Наим.Цена3;
                  пСтрокаФутбНомер=пКодАрт;
               }
   }
#######футболки ищем

}
############# блок поиска и сохранения джинс в чеке
#отладить();
ДляВСех(Наименований())
{
Если(Наим.СуммаЦен>0 и фДжинсыГлоб!=0)
{
Если(Найти(пСтрокаФутбНомер,'Наим.Иерархия.НомНомер')!=0)
   {
   Наим.СуммаЦен=Окр((Наим.Кол_во-1)*Наим.Цена3+Наим.Цена3*0.8,1);
   '.Примечание'="Акция джинсы=-20%";
   'НАИМ.Комментарий'="Акция -20%"; 
  Сохранить(Наим);
   }
}
}


}