Функция _АкцияНоскиЖен2()
{
пКолАкции=0;   
пКодАртикул="";
   ДляВсех(Наименований()) 
   {
      пКодАртикул=";"+'НАИМ.Иерархия.НомНомер'+";";
      Если(Найти(пКодАртикул,";128645;")!=0
      или Найти(пКодАртикул,";128644;")!=0
      или Найти(пКодАртикул,";128643;")!=0
      или Найти(пКодАртикул,";128641;")!=0
      или Найти(пКодАртикул,";128642;")!=0
      или Найти(пКодАртикул,";65309;")!=0
      или Найти(пКодАртикул,";62924;")!=0
      или Найти(пКодАртикул,";133084;")!=0
      или Найти(пКодАртикул,";133077;")!=0
      или Найти(пКодАртикул,";133073;")!=0
      или Найти(пКодАртикул,";128640;")!=0
      или Найти(пКодАртикул,";118500;")!=0
      или Найти(пКодАртикул,";135895;")!=0
      или Найти(пКодАртикул,";105760;")!=0
      или Найти(пКодАртикул,";88338;")!=0
      или Найти(пКодАртикул,";139338;")!=0
      или Найти(пКодАртикул,";139445;")!=0
      или Найти(пКодАртикул,";139448;")!=0
      или Найти(пКодАртикул,";139453;")!=0
      или Найти(пКодАртикул,";139457;")!=0
      или Найти(пКодАртикул,";139458;")!=0
      или Найти(пКодАртикул,";139446;")!=0
      или Найти(пКодАртикул,";73272;")!=0
      или Найти(пКодАртикул,";73280;")!=0
      или Найти(пКодАртикул,";122640;")!=0
или Найти(пКодАртикул,";141379;")!=0
или Найти(пКодАртикул,";141380;")!=0
или Найти(пКодАртикул,";141381;")!=0
или Найти(пКодАртикул,";141382;")!=0
или Найти(пКодАртикул,";139338;")!=0
или Найти(пКодАртикул,";139445;")!=0
или Найти(пКодАртикул,";139446;")!=0
или Найти(пКодАртикул,";139448;")!=0
или Найти(пКодАртикул,";139453;")!=0
или Найти(пКодАртикул,";139457;")!=0
или Найти(пКодАртикул,";139458;")!=0
или Найти(пКодАртикул,";143288;")!=0
или Найти(пКодАртикул,";9456;")!=0
или Найти(пКодАртикул,";123838;")!=0
или Найти(пКодАртикул,";73675;")!=0
или Найти(пКодАртикул,";99009;")!=0
или Найти(пКодАртикул,";37666;")!=0
или Найти(пКодАртикул,";112980;")!=0
или Найти(пКодАртикул,";34450;")!=0
или Найти(пКодАртикул,";11662;")!=0
или Найти(пКодАртикул,";29306;")!=0
или Найти(пКодАртикул,";14424;")!=0
или Найти(пКодАртикул,";52311;")!=0
или Найти(пКодАртикул,";11663;")!=0
или Найти(пКодАртикул,";19272;")!=0
или Найти(пКодАртикул,";12600;")!=0
или Найти(пКодАртикул,";20488;")!=0
или Найти(пКодАртикул,";45123;")!=0
или Найти(пКодАртикул,";118509;")!=0
или Найти(пКодАртикул,";27543;")!=0
или Найти(пКодАртикул,";52399;")!=0
или Найти(пКодАртикул,";16375;")!=0
или Найти(пКодАртикул,";4207;")!=0
или Найти(пКодАртикул,";3140;")!=0
или Найти(пКодАртикул,";16374;")!=0
или Найти(пКодАртикул,";93124;")!=0
или Найти(пКодАртикул,";20901;")!=0
или Найти(пКодАртикул,";87143;")!=0
или Найти(пКодАртикул,";104599;")!=0
или Найти(пКодАртикул,";90113;")!=0
или Найти(пКодАртикул,";72567;")!=0
или Найти(пКодАртикул,";104601;")!=0
или Найти(пКодАртикул,";118513;")!=0
или Найти(пКодАртикул,";9311;")!=0
или Найти(пКодАртикул,";29895;")!=0
или Найти(пКодАртикул,";123745;")!=0
или Найти(пКодАртикул,";29896;")!=0
или Найти(пКодАртикул,";142239;")!=0
или Найти(пКодАртикул,";90110;")!=0
или Найти(пКодАртикул,";72573;")!=0
или Найти(пКодАртикул,";54745;")!=0
или Найти(пКодАртикул,";90112;")!=0
или Найти(пКодАртикул,";52405;")!=0
или Найти(пКодАртикул,";3131;")!=0
или Найти(пКодАртикул,";112979;")!=0
или Найти(пКодАртикул,";132017;")!=0
или Найти(пКодАртикул,";38937;")!=0
      ) пКолАкции+=Наим.Кол_во;
   }
   
   ДляВсех(Наименований()) 
   {
      пКодАртикул=";"+'НАИМ.Иерархия.НомНомер'+";";
      Если(Найти(пКодАртикул,";128645;")!=0
      или Найти(пКодАртикул,";128644;")!=0
      или Найти(пКодАртикул,";128643;")!=0
      или Найти(пКодАртикул,";128641;")!=0
      или Найти(пКодАртикул,";128642;")!=0
      или Найти(пКодАртикул,";65309;")!=0
      или Найти(пКодАртикул,";62924;")!=0
      или Найти(пКодАртикул,";133084;")!=0
      или Найти(пКодАртикул,";133077;")!=0
      или Найти(пКодАртикул,";133073;")!=0
      или Найти(пКодАртикул,";128640;")!=0
      или Найти(пКодАртикул,";118500;")!=0
      или Найти(пКодАртикул,";135895;")!=0
      или Найти(пКодАртикул,";105760;")!=0
      или Найти(пКодАртикул,";88338;")!=0
      или Найти(пКодАртикул,";139338;")!=0
      или Найти(пКодАртикул,";139445;")!=0
      или Найти(пКодАртикул,";139448;")!=0
      или Найти(пКодАртикул,";139453;")!=0
      или Найти(пКодАртикул,";139457;")!=0
      или Найти(пКодАртикул,";139458;")!=0
      или Найти(пКодАртикул,";139446;")!=0
      или Найти(пКодАртикул,";73272;")!=0
      или Найти(пКодАртикул,";73280;")!=0
      или Найти(пКодАртикул,";122640;")!=0
или Найти(пКодАртикул,";141379;")!=0
или Найти(пКодАртикул,";141380;")!=0
или Найти(пКодАртикул,";141381;")!=0
или Найти(пКодАртикул,";141382;")!=0
или Найти(пКодАртикул,";139338;")!=0
или Найти(пКодАртикул,";139445;")!=0
или Найти(пКодАртикул,";139446;")!=0
или Найти(пКодАртикул,";139448;")!=0
или Найти(пКодАртикул,";139453;")!=0
или Найти(пКодАртикул,";139457;")!=0
или Найти(пКодАртикул,";139458;")!=0
или Найти(пКодАртикул,";143288;")!=0
или Найти(пКодАртикул,";9456;")!=0
или Найти(пКодАртикул,";123838;")!=0
или Найти(пКодАртикул,";73675;")!=0
или Найти(пКодАртикул,";99009;")!=0
или Найти(пКодАртикул,";37666;")!=0
или Найти(пКодАртикул,";112980;")!=0
или Найти(пКодАртикул,";34450;")!=0
или Найти(пКодАртикул,";11662;")!=0
или Найти(пКодАртикул,";29306;")!=0
или Найти(пКодАртикул,";14424;")!=0
или Найти(пКодАртикул,";52311;")!=0
или Найти(пКодАртикул,";11663;")!=0
или Найти(пКодАртикул,";19272;")!=0
или Найти(пКодАртикул,";12600;")!=0
или Найти(пКодАртикул,";20488;")!=0
или Найти(пКодАртикул,";45123;")!=0
или Найти(пКодАртикул,";118509;")!=0
или Найти(пКодАртикул,";27543;")!=0
или Найти(пКодАртикул,";52399;")!=0
или Найти(пКодАртикул,";16375;")!=0
или Найти(пКодАртикул,";4207;")!=0
или Найти(пКодАртикул,";3140;")!=0
или Найти(пКодАртикул,";16374;")!=0
или Найти(пКодАртикул,";93124;")!=0
или Найти(пКодАртикул,";20901;")!=0
или Найти(пКодАртикул,";87143;")!=0
или Найти(пКодАртикул,";104599;")!=0
или Найти(пКодАртикул,";90113;")!=0
или Найти(пКодАртикул,";72567;")!=0
или Найти(пКодАртикул,";104601;")!=0
или Найти(пКодАртикул,";118513;")!=0
или Найти(пКодАртикул,";9311;")!=0
или Найти(пКодАртикул,";29895;")!=0
или Найти(пКодАртикул,";123745;")!=0
или Найти(пКодАртикул,";29896;")!=0
или Найти(пКодАртикул,";142239;")!=0
или Найти(пКодАртикул,";90110;")!=0
или Найти(пКодАртикул,";72573;")!=0
или Найти(пКодАртикул,";54745;")!=0
или Найти(пКодАртикул,";90112;")!=0
или Найти(пКодАртикул,";52405;")!=0
или Найти(пКодАртикул,";3131;")!=0
или Найти(пКодАртикул,";132017;")!=0
или Найти(пКодАртикул,";112979;")!=0
или Найти(пКодАртикул,";38937;")!=0
      ) 
      {
#      Если(пКолАкции==1) 
#         {
#            'Наим.СуммаЦен'=Окр(69*Наим.Кол_во,1);
#            '.Примечание'="Акция-носки";
#         }
      Если(пКолАкции==2) 
         {
            'Наим.СуммаЦен'=Окр(69*Наим.Кол_во,1);
            '.Примечание'="Акция-носки";
         }
      Если(пКолАкции>=3) 
         {
            'Наим.СуммаЦен'=Окр(59*Наим.Кол_во,1);
            '.Примечание'="Акция-носки";
         }

      }
   }
}