Функция _НомерМагазина(пВыб)
{
#возвращает номер магазина по его сокращению
   Если(пВыб=="ES") Вернуть("30");                  #01
   Если(пВыб=="UZ") Вернуть("31");                  #02
   Если(пВыб=="DM") Вернуть("27");                  #03 
   Если(пВыб=="PR") Вернуть("28");                  #04
   Если(пВыб=="OK") Вернуть("25");                  #06
   Если(пВыб=="RS") Вернуть("36");                  #07
   Если(пВыб=="EU") Вернуть("21");                  #08
   Если(пВыб=="CP") Вернуть("34");                  #09
   Если(пВыб=="SL") Вернуть("29");                  #10
   Если(пВыб=="MD") Вернуть("26");                  #11
   Если(пВыб=="SD") Вернуть("37");                  #12
   Если(пВыб=="AT") Вернуть("38");                  #13
   Если(пВыб=="UP") Вернуть("39");                  #15
   Если(пВыб=="KM") Вернуть("45");                  #17
   Если(пВыб=="TP") Вернуть("47");                  #18
   Если(пВыб=="GB") Вернуть("48");                  #20
   Если(пВыб=="PK") Вернуть("33");                  #21
   Если(пВыб=="BK") Вернуть("54");                  #23
   Если(пВыб=="UK") Вернуть("59");                  #26
   Если(пВыб=="LT") Вернуть("61");                  #27
   Если(пВыб=="JM") Вернуть("63");                  #28
   Если(пВыб=="BD") Вернуть("64");                  #29
   Если(пВыб=="PY") Вернуть("71");                  #31
   Если(пВыб=="RB") Вернуть("77");                  #32
   Если(пВыб=="BU") Вернуть("80");                  #33
   Если(пВыб=="OB") Вернуть("81");                  #34
   Если(пВыб=="OD") Вернуть("82");                  #35
   Если(пВыб=="OO") Вернуть("79");                  #36
   Если(пВыб=="UM") Вернуть("83");                  #37
   Если(пВыб=="PM") Вернуть("84");                  #38
   Если(пВыб=="PB") Вернуть("86");                  #39
   Если(пВыб=="GM") Вернуть("88");                  #40
   Если(пВыб=="SB") Вернуть("87");                  #41
   Если(пВыб=="CB") Вернуть("90");                  #42
   Если(пВыб=="CD") Вернуть("91");                  #43
   Если(пВыб=="US") Вернуть("68");                  #44
   Если(пВыб=="NP") Вернуть("108");                 #45
   Если(пВыб=="BB") Вернуть("113");                 #47
   Если(пВыб=="PZ") Вернуть("172");                 #49
   Если(пВыб=="PT") Вернуть("174");                 #50
   Если(пВыб=="PC") Вернуть("178");                 #51
   Вернуть("ТОВАРЫ И МАТЕРИАЛЫ");
}