Функция _ТКК_476(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;MD;KM;TP;GB;;BK;;;UK;LT;JM;BD;US;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;CB;CD;NP;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрокаКат13="126;194;196;197;199;200;201;202;203;204;206;210;211;224";
пСтрокаКат132="197;315;316;317;318;320;321;322;323;328;332;336;338;339;340;342;343;346;349;350;364;365";
пСтрокаКат133="318;324;340;341;342;344;345;346;348;349;350;351;352;356;358;364;365";

ДляВсех(Товаров(1,пКодарт))
   {
      Если(('ТОВАР.Класс'=="1" 
      и 'ТОВАР.Группа'=="3"
      и (Найти(пСтрокаКат13,'ТОВАР.Категория')!=0))
      или
      ('ТОВАР.Класс'=="1" 
      и 'ТОВАР.Группа'=="32"
      и (Найти(пСтрокаКат132,'ТОВАР.Категория')!=0))
      или
      ('ТОВАР.Класс'=="1" 
      и 'ТОВАР.Группа'=="33"
      и (Найти(пСтрокаКат133,'ТОВАР.Категория')!=0))
      ) Вернуть(1) 
      Иначе Вернуть(0);
   }
}