Функция _ТКК_473(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;MD;KM;TP;GB;;BK;;;UK;LT;JM;BD;US;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;CB;CD;NP;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрокаКат11="133;134;139;140;141;142;143;146;147;148;149;150;151;169;171;174;182;300;301;";
ДляВсех(Товаров(1,пКодарт))
   {
      Если(('ТОВАР.Класс'=="1" 
      и 'ТОВАР.Группа'=="1"
      и (Найти(пСтрокаКат11,'ТОВАР.Категория')!=0))
      ) Вернуть(1) 
      Иначе Вернуть(0);
   }
}
