функция incanto_attiva_40_2плюс1_878(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;CP;RS;SD;AT;UP;KM;TP;GB;BK;;UK;LT;JM;BD;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;CB;CD;NP;PZ;PT;PC;PZ;PY;PM;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2625;2628;2812;2832;2869;2870;2871;2872;15259;15260;15261;15262;15408;24012;28385;30020;34186;102732;102738;102740;102743;102748;102749;102750;102751;106748;106749;106750;106754;110256;110257;110258;115256;115257;115258;115567;117764;"
пСтрока.2=";197563;201632;203187;203494;204281;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
