функция incanto_attiva_40_2плюс1__подарок_879(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;BL;KM;TP;GB;;BK;CV;;UK;LT;JM;BD;US;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;CB;CD;NP;BB;;BP;PZ;PT;PC;PZ;PY;PM;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2565;2566;2575;2577;2587;2592;2632;2635;2659;2696;2697;2708;2709;2728;2729;2734;2804;2806;2867;2876;2877;7231;7250;12524;13453;13455;15747;20518;20566;21782;24996;59524;65709;65711;74506;76334;102351;109819;113356;114684;115255;145396;"
пСтрока.2=";154619;194569;202073;202909;202916;202963;204053;204054;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
