функция pelican_детские_куртки_минус_30_944(пКодарт)
{
пСтрокаМаг=";SL;UK;BD;OO;OB;OD;SB;BP;PZ;PZ;UK;BD;OO;OD;SL;SB;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";210356;210357;210358;210359;210360;251549;251550;251551;251552;251553;251556;251557;251558;251559;251560;251561;251562;251563;251564;251565;251566;251567;251568;251569;251570;251571;251572;251573;251574;251575;251576;251578;251585;"
пСтрока.2=";252892;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
