функция sisi_fascino__2_плюс_1_подарок_681(пКодарт)
{
пСтрокаМаг=";EU;RS;GB;LT;JM;RB;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2577;2591;2592;2598;2697;2708;2709;2728;13453;13455;15747;19743;21782;53461;65709;74506;79682;115255;134298;134304;202073;202916;202963;204054;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
