функция sisi_fascino__2_плюс_1_680(пКодарт)
{
пСтрокаМаг=";EU;RS;GB;LT;JM;RB;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2591;2592;2598;2619;2624;2628;2632;2633;2635;2636;2640;2645;2649;2812;2869;2872;4081;19743;22115;79682;103823;134298;134304;194569;197563;202909;202916;202963;209946;211480;211521;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
