функция vis_a_vis_носки_женские_695949_632(пКодарт)
{
пСтрокаМаг=";SL;AT;SB;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";78522;78525;78527;78551;89175;89177;102346;102348;142197;151485;151490;151491;151516;151520;151523;151525;152892;152894;181834;181844;181846;181847;181848;181849;181850;194610;194612;194614;194616;194619;194623;194624;194625;194626;"
пСтрока.2=";194627;207580;207587;207588;207589;212632;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
