функция акция_3000_бюсты_262(пКодарт)
{
Если('Дата'<Дата("01.03.2013") или 'Дата'>Дата("08.03.2013")) Вернуть(0);
пСтрокаМаг=";AT;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";34738;52315;59854;80252;81256;83766;86950;98647;98648;103114;103115;103116;103117;103118;103362;110297;110298;110929;116346;117185;117188;117394;120082;120087;121715;121777;122175;122176;122177;122600;"
пСтрока.2=";122601;122767;122768;122769;123906;123907;126357;127804;130844;186725;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
