функция акция_носки_мужские_69_59_49_20(пКодарт)
{
Если('Дата'<Дата("26.01.2012") или 'Дата'>Дата("24.02.2013")) Вернуть(0);
пСтрокаМаг=";DM;UZ;PK;KM;BK;PY;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";3051;3685;4817;5229;6147;7249;7659;10360;13592;13603;13621;13624;13644;15474;15779;16179;16417;17167;17602;23753;26018;26699;29576;30426;35575;38091;38911;40507;42594;43011;43014;43966;44907;44937;54690;"
пСтрока.2=";56206;58327;58649;61942;65742;65744;71372;73453;78106;78107;86615;99377;99378;99435;128402;128403;129664;141066;153657;197475;197476;197477;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
