функция акция_детское_57(пКодарт)
{
Если('Дата'<Дата("07.02.2013") или 'Дата'>Дата("07.03.2013")) Вернуть(0);
пСтрокаМаг=";PR;ES;CP;UP;UK;BD;PY;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";107993;108012;109005;109007;109209;109428;112193;112437;114032;127274;132955;141779;142566;143850;143851;145656;189506;189568;189744;190049;190374;190680;190845;190985;191634;192871;192896;192901;192923;"
пСтрока.2=";192941;192957;192961;193656;193693;193969;194280;194719;195208;195211;195498;195529;195556;195915;196358;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
