функция акция_носки_жен_69_59_49_17(пКодарт)
{
пСтрокаМаг=";OK;DM;PR;SL;ES;SD;UP;TP;BK;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";14424;31201;43966;44937;57153;77227;78566;99009;122640;135896;145542;147716;148845;152540;152543;196744;196745;196746;197487;197488;197489;197491;197492;197493;197494;198607;199358;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
