функция акция_детское_подарок_56(пКодарт)
{
Если('Дата'<Дата("07.02.2013") или 'Дата'>Дата("07.03.2013")) Вернуть(0);
пСтрокаМаг=";PR;ES;CP;UP;UK;BD;PY;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";107738;107740;107804;107807;107810;107813;107849;109141;111028;112193;112259;112696;126150;134208;192994;196741;196742;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
