функция акция_подарок_2_плюс_1_296(пКодарт)
{
Если('Дата'<Дата("03.04.2013") или 'Дата'>Дата("06.06.2013")) Вернуть(0);
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;MD;KM;TP;GB;;BK;;;;UK;LT;JM;BD;;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;;CB;CD;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2637;54955;100980;100982;118307;134408;180887;202909;202916;202963;204053;204054;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
