функция акция_в_юз_12(пКодарт)
{
пСтрокаМаг=";UZ;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";104222;112667;139211;139227;139255;139258;140149;140890;140894;140911;142222;142814;143721;143783;190125;190184;190185;190186;190187;190260;190263;190323;190326;190328;190505;190516;190517;192849;192876;"
пСтрока.2=";192877;193017;193022;193028;193034;193094;193937;194362;194635;194637;195403;195404;195428;195440;195487;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
