функция акция_10_15_20_316(пКодарт)
{
#просто проверка на магазин и на дату
Если('Дата'<Дата("01.05.2013") или 'Дата'>Дата("05.05.2013")) Вернуть(0);
пСтрокаМаг="GB;JM;LT;EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;UP;KM;TP;;BK;UK;BD;PY;RB;OO;BU;OB;OD;UM;PM;PB;SB;GM;CB;CD;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
Вернуть(1);
#пСтрока.1=";141300;"
#  пКолСтрокакции=2;
#  пСч=1;
#  Пока(пСч<пКолСтрокакции)
#  {
#    Если(Найти(пСтрока[пСч], пКодарт)!=0)
#      {пСч=1000;}#типа выход из цикла}
#    пСч++;
#  }
#  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}