функция акция_купиб_платим_исключения_281(пКодарт)
{
пСтрока.1=";2745;2832;2833;2858;2859;2874;2875;2876;2877;2886;2910;4011;5371;5505;6718;8053;10832;11079;20567;20945;21268;24454;28271;28272;29086;40899;44121;62974;74425;79386;80950;84783;86448;103822;110911;121409;"
пСтрока.2=";197563;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}