функция акция_носки_женские_79_69_59_48(пКодарт)
{
Если('Дата'<Дата("30.06.2012") или 'Дата'>Дата("01.03.2013")) Вернуть(0);
пСтрокаМаг=";EU;DM;UZ;PK;RS;KM;TP;GB;BK;LT;JM;PY;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";118511;132015;148628;148629;148630;148632;148633;148634;148635;148636;148637;148638;148639;148925;152479;152480;152481;152482;152483;153018;153020;153021;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
