функция атлант_при_покупке_бюста_и_труса_скидка_30_бюсты_577(пКодарт)
{
пСтрокаМаг=";AT;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";103114;103116;103118;121777;154019;188431;188436;188557;188741;197596;200080;202274;204073;211027;211028;211029;211031;211032;211512;211513;211514;214351;214352;214353;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
