функция атлант_распродажа_минус_50_кол_осень_зима_14_979(пКодарт)
{
пСтрокаМаг=";AT;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";249947;249952;249955;249957;250134;250135;250136;250137;250139;250142;250144;250145;250148;250150;250151;250152;250202;250203;250205;250250;250290;250381;250917;250920;250921;251291;251295;251332;252134;252716;252724;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
