функция вторая_вещь_со_скидкой_30_детское_708(пКодарт)
{
пСтрокаМаг=";UP;UK;BD;PY;OD;PB;SB;PZ;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";181188;181189;181191;181192;181195;182405;186386;186387;187961;187962;187963;200188;200189;200190;200191;200192;200193;202532;202534;202535;202536;202539;202540;202541;202542;202544;202547;202548;202549;202550;202551;202552;202553;"
пСтрока.2=";202554;202555;202556;202557;202738;202977;204002;204050;204157;204160;204742;204750;205378;205395;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
