функция детское__минус30_для_чепецка_369(пКодарт)
{
Если('Дата'<Дата("30.06.2013") или 'Дата'>Дата("01.07.2013")) Вернуть(0);
пСтрокаМаг=";BD;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";140576;140591;148784;148785;148786;148789;148790;148794;148795;148797;148798;148804;204432;204433;204435;204440;204441;204442;204443;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
