функция единая_цена_носки_жен_39_руб_чепецк_русь_284(пКодарт)
{
пСтрокаМаг=";CP;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";9755;16259;16921;16929;23242;23279;23283;23284;23290;23291;25403;26263;26264;26698;29485;34290;35356;35863;36411;37909;39718;39719;41168;41406;44415;46754;47728;52311;55341;55346;55349;55888;55889;55890;"
пСтрока.2=";55901;58930;61944;66918;74634;76856;80768;85653;89822;91780;95355;112105;115475;115934;115935;115976;119017;127802;149336;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
