функция колготки_2_пары_10процентов_3_пары_15_процентов_489(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;BL;KM;TP;GB;;BK;CV;;UK;LT;JM;BD;US;;PY;RB;OO;BU;OB;UM;PM;;SB;GM;CB;NP;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2818;2913;4127;4219;4603;4605;10504;79896;85109;85115;85116;85117;101637;103826;103827;103828;103829;103830;103832;104304;104322;122180;122503;140348;141695;206513;212274;212275;212700;213116;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
