функция колготки_3_пары_скидка_20_список_исключений_330(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;CP;RS;SD;AT;UP;;MD;KM;TP;GB;;BK;;;LT;JM;BD;US;;KCHSU;RB;OO;BU;OB;OD;UM;;PB;SB;GM;;CB;CD;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2745;2804;2870;2871;7231;74425;90978;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
