функция колгтки_70_ден_2_пары_минус_20_процентов_662(пКодарт)
{
пСтрокаМаг=";BK;BU;CB;BB;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2632;2633;2635;2636;2638;2640;2643;2644;2645;2649;2869;2872;4081;22115;25378;28270;30786;90978;103822;197563;202909;202916;202963;204054;209946;211480;211521;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
