функция колготки_2_пары_10_3пары_15_143(пКодарт)
{
Если('Дата'<Дата("05.10.2012") или 'Дата'>Дата("12.02.2013")) Вернуть(0);
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;MD;KM;TP;GB;;BK;;;UK;LT;JM;BD;;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;CB;CD;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";85109;85116;85117;101637;103826;103827;103828;103829;103830;103832;104304;104491;122180;140348;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
