функция красная_горка_колготки_минус_20_518(пКодарт)
{
пСтрокаМаг=";UP;GM;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2592;2596;2597;2603;2649;2658;2731;2771;2858;2876;2877;2910;4081;6718;7362;8901;11642;18147;24454;25013;28271;28272;29086;29642;34108;51021;55572;55942;75674;79397;80940;99556;114343;115234;124776;136303;141349;141643;143978;152044;"
пСтрока.2=";152047;152049;190421;202963;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
