функция купи_2_вещи_3_в_подарок_муж_и_жен_включение_860(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;UP;;BL;KM;TP;GB;;BK;CV;;UK;LT;JM;BD;US;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;CB;CD;NP;BB;;BP;PZ;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";213510;213511;213512;213513;214544;214546;217179;218889;242824;244898;244959;245199;245200;245682;245683;245700;246063;246065;246166;246320;246321;246337;246351;246353;246359;246526;246547;246548;246969;247335;247364;247442;247443;"
пСтрока.2=";247751;247906;248039;248156;248182;248194;248195;248415;248461;248509;248510;248570;248616;248698;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
