функция нг_три_труса_муж_скидка_минус_30_процентов_576(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;BL;KM;TP;GB;;BK;CV;;UK;LT;JM;BD;US;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;CB;CD;NP;BB;;BP;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";65590;126077;133626;144040;144041;144063;174964;174965;174970;175055;175068;175069;190661;190662;191034;191068;191070;191072;202178;202179;205715;205716;205717;205718;205725;205726;205727;205729;205737;205738;205739;205740;211608;212207;"
пСтрока.2=";212481;214143;214192;214486;217073;217074;217076;217077;217078;217079;217082;217083;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
