функция носки_муж_malemi_79_69_59_247(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;SD;AT;UP;;KM;TP;GB;BK;LT;JM;PY;RB;OO;UM;PM;SB;GM;NP;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";3011;3012;3685;4809;4817;5229;6540;6542;7248;7249;7659;15779;17602;20177;26015;26017;26018;26699;26802;31166;35575;38911;40507;44907;58327;77974;78441;99435;123348;123351;127370;127371;128597;141066;145377;149486;152834;153657;174955;"
пСтрока.2=";180960;180967;180973;180978;180980;180984;180990;180992;180993;182161;197474;197475;197476;197478;202472;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
