функция носки_жен_тс_зима_99_89_79_913(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;SD;AT;UP;BL;KM;TP;GB;;BK;LT;JM;PY;RB;OO;OD;UM;PM;SB;CB;NP;GB;PZ;PT;PC;PZ;PY;PM;JM;GB;UZ;DM;EU;CB;OO;KM;RB;UP;NP;TP;ES;SD;OK;PR;SB;MD;GL;GL;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";22447;88344;97313;122642;139322;139337;139340;139452;139455;139456;141380;153039;153096;153110;153111;153127;153163;153183;175191;175192;175193;175194;178803;180403;180404;180405;212195;212196;212197;212198;212199;212200;212201;212202;"
пСтрока.2=";213214;217889;217890;217891;252200;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
