функция носки_жен_79_69_59_275(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;UZ;PK;CP;SD;UP;KM;TP;GB;BK;LT;JM;PY;RB;OO;SB;CB;NP;PZ;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";22283;23201;77933;135896;145542;188278;188279;188280;188284;188285;188286;196744;196745;196746;199358;203704;203705;203706;203707;203708;203709;203710;241117;241120;241121;241126;241131;241132;241147;241148;241149;241266;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
