функция носки_муж_biz_1пара_по_127_3_пары_по_87_246(пКодарт)
{
пСтрокаМаг=";EU;GB;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";25288;25875;26014;27379;29577;29579;30423;40511;44917;55563;58315;58317;58319;58325;81998;81999;82000;91437;91440;91441;91450;91452;91453;91454;91455;91456;91457;91460;91461;91462;91463;91464;91465;91466;"
пСтрока.2=";91474;98768;105441;105442;105443;105445;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
