функция носки_муж796959атлант_280(пКодарт)
{
пСтрокаМаг=";AT;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";78441;79408;79409;79410;80638;80639;80780;81271;81272;88016;92319;92320;92321;92322;92323;92324;96399;107623;107624;107625;117283;117284;123346;123348;123351;125965;127148;127370;127371;128597;128598;130161;"
пСтрока.2=";130163;145377;149486;152833;152834;193318;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
