функция носки_женские_99_79_132(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;UZ;PK;CP;RS;SD;UP;KM;TP;GB;;BK;LT;JM;PY;RB;OO;OB;OD;UM;PM;PB;SB;GM;CB;CD;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";11662;11663;12600;19269;19272;20488;20805;22447;29306;30429;30803;30804;30807;45123;97313;122642;122701;123743;123744;123745;123746;123747;126047;126058;126065;139322;139452;153039;153096;153110;153111;153127;153163;153183;175191;175192;"
пСтрока.2=";175193;175194;178803;180403;180404;180405;212196;212197;212198;212199;212200;212201;212202;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
