функция осенний_марафон_носки_список_на_исключение_130(пКодарт)
{
пСтрока.1=";3051;3685;4817;5229;6147;7249;7659;10360;13592;13603;13624;13644;15474;15779;16417;17602;23753;26018;26699;29576;30426;35575;38911;40507;42594;43011;43014;43966;44907;44937;54690;56206;58327;58649;61942;"
пСтрока.2=";65742;65744;71372;78106;78107;86615;99377;99378;99435;128402;128403;129664;141066;197476;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
