функция партнер_колготки_2_плюс_1__подарок_729(пКодарт)
{
пСтрокаМаг=";PR;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2577;2591;2592;2598;2697;2702;2708;2709;2728;2876;2877;5371;5505;13453;13455;15747;19743;25378;53461;65709;79682;115255;122735;134298;134304;202073;202916;202963;204054;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
