функция партнер_колготки_2_плюс_1_728(пКодарт)
{
пСтрокаМаг=";PR;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2597;2632;2633;2635;2636;2637;2638;2640;2644;2645;2649;2696;2702;2869;2872;2876;2877;2886;2899;2900;2910;4011;4081;5371;5505;8053;22115;24454;25378;29086;30789;45802;45804;122735;194276;197563;202909;202916;202963;203187;209946;211480;"
пСтрока.2=";211521;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
