функция при_покупке_бюста_и_труса_скидка_20_на_комп_бюсты_720(пКодарт)
{
пСтрокаМаг=";AT;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";103114;103116;103118;121777;154019;154020;188557;197596;202274;211027;211031;211514;218630;218713;218719;218722;220329;220330;241065;242757;242791;242792;242793;242794;242795;242796;242797;242798;242799;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
