функция при_покупке_3вещей_скидка_20процентов_471(пКодарт)
{
Если('Дата'>=Дата("06.09.2013") и 'Дата'<=Дата("30.09.2013"))
{
   пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;MD;KM;TP;GB;;BK;;;UK;LT;JM;BD;US;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;CB;CD;NP;";
   Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
   пСтрока.1=";2002;145986;147883;148739;148774;181341;181344;181478;181480;181485;181487;181488;195932;203114;203465;203749;204152;204153;204236;204367;204520;204625;204627;204735;204736;204805;204808;204831;205119;205384;205385;205388;205390;205391;"
   пСтрока.2=";205428;205430;205575;205601;205620;205621;205631;205633;205635;205636;205637;205638;205639;205641;205642;205675;"
     пКолСтрокакции=3;
     пСч=1;
     Пока(пСч<пКолСтрокакции)
     {
       Если(Найти(пСтрока[пСч], пКодарт)!=0)
         {пСч=1000;}#типа выход из цикла}
       пСч++;
     }
}
Иначе  Вернуть(0);
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}