функция при_покупке_3_х_трусов_подарок_носки_260(пКодарт)
{
Если('Дата'<Дата("05.10.2012") или 'Дата'>Дата("24.02.2013")) Вернуть(0);
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;SD;UP;KM;TP;GB;BK;LT;JM;PY;RB;OO;UM;PM;SB;GM;CB;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";182161;197476;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
