функция при_покупке_2_х_пар_колготок_подарок_249(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;KM;TP;GB;;BK;LT;JM;PY;KCHSU;RB;OO;OB;UM;PM;SB;GM;CB;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2571;2572;2575;2582;2583;2586;2591;2598;2600;2703;2706;2715;2721;2736;2737;2837;2852;2855;2857;4004;4076;4187;7676;9624;10289;10290;12524;19743;22795;24473;24996;24997;24998;24999;25000;25004;25005;25006;"
пСтрока.2=";28631;30788;47778;74550;74555;106930;109819;115234;115236;115240;115242;121401;121403;174949;179133;182288;182289;182290;182291;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
