функция с_3_000_подарок_7_и_8_марта_268(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;MD;KM;TP;GB;;BK;;;UK;LT;JM;BD;;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;;CB;CD;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";63885;97811;147876;147909;179736;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
