функция театральный_колготки_минус_20_процентов_517(пКодарт)
{
пСтрокаМаг=";TP;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2566;2596;2597;2620;2623;2628;2636;2648;2670;2771;2776;2821;2886;2899;2900;2910;4011;4219;4595;5371;5505;8053;8901;10149;10494;10832;11079;11642;16733;18147;19681;20892;24012;24454;28271;28272;29086;35573;44554;48084;48972;54721;59346;"
пСтрока.2=";80940;83408;99556;100997;100998;100999;101377;103739;104257;104258;124354;124359;126137;143978;202963;204053;204054;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
