функция три_список_исключений_подследники_332(пКодарт)
{
пСтрокаМаг=";EU;OK;MD;DM;PR;SL;ES;UZ;PK;CP;RS;SD;AT;UP;;MD;KM;TP;GB;;BK;;;UK;LT;JM;BD;;;PY;KCHSU;RB;OO;BU;OB;OD;UM;PM;;PB;SB;GM;;CB;CD;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";2903;2976;2984;7778;8111;8479;10721;11461;15717;16235;18221;23303;24619;25914;25915;26020;26037;26040;26150;27244;28188;36412;39980;40951;57165;57286;57288;71643;72007;72010;72104;75338;75341;77933;81368;81764;91530;91531;93054;94944;"
пСтрока.2=";94946;94947;96494;96496;96498;96500;97303;116971;116976;117963;117975;118767;118768;119319;123340;134292;134567;134768;135284;197533;198891;198892;203739;"
  пКолСтрокакции=3;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
