функция футболка_дет_197_147_127_839(пКодарт)
{
пСтрокаМаг=";PR;SL;UP;UK;LT;BD;PY;OO;OB;OD;PB;SB;GM;BP;PZ;";
Если(Найти(пСтрокаМаг,КаСНОМ)==0) Вернуть(0);
пСтрока.1=";107807;107810;196741;196742;206178;206366;206498;206499;207125;207126;207127;207128;207130;207132;207135;207137;207138;207145;207151;207152;207156;207158;207160;207163;207164;207167;219285;219286;247354;247355;248437;248441;"
  пКолСтрокакции=2;
  пСч=1;
  Пока(пСч<пКолСтрокакции)
  {
    Если(Найти(пСтрока[пСч], пКодарт)!=0)
      {пСч=1000;}#типа выход из цикла}
    пСч++;
  }
  Если(пСч>=1000) Вернуть(1) иначе Вернуть(0);
}
